<!-- add-pr-comment:add-pr-comment -->

## Terraform github repositories plan
```
data.github_team.cloud_optimisation_and_accountability: Reading...
module.ministryofjustice.module.coat-cur-data-pipeline.github_repository.default: Refreshing state... [id=coat-cur-data-pipeline]
module.ministryofjustice.module.cloud-optimisation-and-accountability.github_repository.default: Refreshing state... [id=cloud-optimisation-and-accountability]
module.ministryofjustice.module.coat-cur-data-pipeline.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.coat-cur-data-pipeline.github_branch_protection.default: Refreshing state... [id=BPR_kwDOPEW5ds4D8FHf]
module.ministryofjustice.module.coat-cur-data-pipeline.data.github_actions_public_key.default: Read complete after 0s [id=3380204578043523366]
data.github_team.cloud_optimisation_and_accountability: Read complete after 4s [id=12623342]
module.ministryofjustice.module.coat-cur-data-pipeline.github_team_repository.admin["12623342"]: Refreshing state... [id=12623342:coat-cur-data-pipeline]
module.ministryofjustice.module.cloud-optimisation-and-accountability.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.cloud-optimisation-and-accountability.github_team_repository.admin["12623342"]: Refreshing state... [id=12623342:cloud-optimisation-and-accountability]
module.ministryofjustice.module.cloud-optimisation-and-accountability.github_branch_protection.default: Refreshing state... [id=BPR_kwDOOWCmUs4D8FHk]
module.ministryofjustice.module.cloud-optimisation-and-accountability.data.github_actions_public_key.default: Read complete after 0s [id=3380204578043523366]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ministryofjustice.module.cloud-optimisation-and-accountability.github_branch_protection.default has changed
  ~ resource "github_branch_protection" "default" {
      + force_push_bypassers            = []
        id                              = "BPR_kwDOOWCmUs4D8FHk"
      + push_restrictions               = []
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          + dismissal_restrictions          = []
          + pull_request_bypassers          = []
            # (5 unchanged attributes hidden)
        }

      ~ required_status_checks {
          + contexts = []
            # (1 unchanged attribute hidden)
        }
    }

  # module.ministryofjustice.module.cloud-optimisation-and-accountability.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"663dc3a284215f2c94bc691a13ced5a7fe9272a586b773c9ca0df39916faed5c\"" -> "W/\"3ef812a5c03243ec20178d336e92550cc71576ea7f50e933eb6b0b3db84ad9d4\""
        id                          = "cloud-optimisation-and-accountability"
        name                        = "cloud-optimisation-and-accountability"
        # (36 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.coat-cur-data-pipeline.github_branch_protection.default has changed
  ~ resource "github_branch_protection" "default" {
      + force_push_bypassers            = []
        id                              = "BPR_kwDOPEW5ds4D8FHf"
      + push_restrictions               = []
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          + dismissal_restrictions          = []
          + pull_request_bypassers          = []
            # (5 unchanged attributes hidden)
        }

      ~ required_status_checks {
          + contexts = []
            # (1 unchanged attribute hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.ministryofjustice.module.terraform-github-repository-testing.data.github_actions_public_key.default will be read during apply
  # (config refers to values not yet known)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = (known after apply)
    }

  # module.ministryofjustice.module.terraform-github-repository-testing.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.ministryofjustice.module.terraform-github-repository-testing.github_repository.default will be created
  + resource "github_repository" "default" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "A GitHub repository for the Cloud Optimisation and Accountability Team • This repository is defined and managed in Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = true
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + homepage_url                = "https://github.com/ministryofjustice/terraform-github-repository"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "terraform-github-repository"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "cloud-optimisation-and-accountability",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "ministryofjustice"
          + repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.terraform-github-repository-testing.github_team_repository.admin["12623342"] will be created
  + resource "github_team_repository" "admin" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "terraform-github-repository"
      + team_id    = "12623342"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```